# Data Integration

## Concatenation

In [1]:
import pandas as pd

In [3]:
df1 = pd.DataFrame(
    {"A":[1,2,3], "name":[0,9,8], "age":[2,4,6]}
)
df2 = pd.DataFrame(
    {"acc":[5,6,10], "loan":[44,55,3]}
)

In [4]:
df1

   A  name  age
0  1     0    2
1  2     9    4
2  3     8    6

In [5]:
df2

   acc  loan
0    5    44
1    6    55
2   10     3

In [8]:
row_concat = pd.concat([df1, df2], axis=0)

In [9]:
row_concat

     A  name  age   acc  loan
0  1.0   0.0  2.0   NaN   NaN
1  2.0   9.0  4.0   NaN   NaN
2  3.0   8.0  6.0   NaN   NaN
0  NaN   NaN  NaN   5.0  44.0
1  NaN   NaN  NaN   6.0  55.0
2  NaN   NaN  NaN  10.0   3.0

In [10]:
column_concat = pd.concat([df1, df2], axis=1)

In [11]:
column_concat

   A  name  age  acc  loan
0  1     0    2    5    44
1  2     9    4    6    55
2  3     8    6   10     3

## Merging

In [12]:
df1 =  pd.DataFrame(
    {"key":["A","B","C","D"], "inv_val":[22,34,55,66], "acc":[4,7,8,9]}
)

In [27]:
df2 =  pd.DataFrame(
    {"key":["E","F","G","H"], "hel_ration":[25,34,95,16], "acc":[4,7,88,12]}
)

In [28]:
df1

  key  inv_val  acc
0   A       22    4
1   B       34    7
2   C       55    8
3   D       66    9

In [29]:
df2

  key  hel_ration  acc
0   E          25    4
1   F          34    7
2   G          95   88
3   H          16   12

In [30]:
pd.merge(df1, df2, how = "inner", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A       22    4       E          25
1       B       34    7       F          34

In [31]:
pd.merge(df1, df2, how = "outer", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A     22.0    4       E        25.0
1       B     34.0    7       F        34.0
2       C     55.0    8     NaN         NaN
3       D     66.0    9     NaN         NaN
4     NaN      NaN   12       H        16.0
5     NaN      NaN   88       G        95.0

In [32]:
pd.merge(df1, df2, how = "left", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A       22    4       E        25.0
1       B       34    7       F        34.0
2       C       55    8     NaN         NaN
3       D       66    9     NaN         NaN

In [33]:
pd.merge(df1, df2, how = "right", on = "acc", suffixes=("_df1","_df2"))

  key_df1  inv_val  acc key_df2  hel_ration
0       A     22.0    4       E          25
1       B     34.0    7       F          34
2     NaN      NaN   88       G          95
3     NaN      NaN   12       H          16

In [35]:
# merge with df 
df1.merge(df2, how = "inner", on = "acc")

  key_x  inv_val  acc key_y  hel_ration
0     A       22    4     E          25
1     B       34    7     F          34

## Joining